장점:
#생산성 향상되어 수확량이 일정하며 자동화로 인해 인건비가 줄어들고 ,절약예측를 하여 낭비되는 자원이 없고 ,분석원격에 의해 갑자기 생기는
단점:
#초기 비용이 높고 개인 정보 보호가 아직 확실하지 않으며 의존성과 취약성이 작용하여 양날의 검이 될수도 있다

스마트 팜에 들어가는 대표적인 예시로는 UV센서,PH센서,식물용LED가 있다

UV 센서는 스마트 팜에서 사용되는 센서로, 자외선(UV)의 강도를 측정하여 작물의 햇빛 노출량과 UV 지수를 모니터링하고, 작물 보호와 관리에 활용됩니다.

pH 센서는 스마트 팜에서 사용되는 센서로, 토양 또는 물의 산성 또는 알칼리성 수준을 측정하여 작물의 적절한 환경을 유지하고 영양 흡수를 개선하는 데 활용됩니다.

식물용 LED는 스마트 팜에서 사용되는 조명 시스템으로, 적절한 파장과 광도를 조절하여 식물의 광합성과 생장을 촉진하고 광원을 제공하는 역할을 합니다.

SMPS는 스마트 팜에서 전력 변환과 안정적인 전원 공급을 위해 사용되며, LED 조명 시스템, 센서, 자동화 장치 등에 필요한 안정적이고 효율적인 전원을 제공하는 역할을 합니다.

EC센서원리 : EC센서의 전극이 용액 속 이온과 상호작용하는데, 이때 용액 내 이온의 양과 이온 운동성에 따라 전기 전도도가 변화하는 것을 이용하여 전도도를 측정한다.

ESP32
ESP32는 Espressif Systems사에서 개발한 저전력 마이크로컨트롤러(마이크로컨트롤러 유닛 + Wi-Fi 및 블루투스 모듈)이다. ESP32는 주로 인터넷 연결이 필요한 IoT(Internet of Things) 프로젝트 및 응용 프로그램에 널리 사용된다.
